tests/performance/artillery-socketio.yml
config:
  target: "{{ $processEnvironment.WS_BASE_URL }}"
  phases:
    - duration: 60
      arrivalRate: 1
      name: calentamiento
    - duration: 180
      arrivalRate: 5
      name: operacion_real
    - duration: 60
      arrivalRate: 8
      name: pico_controlado
  engines:
    socketio-v3: {}
  processor: "./ws-processor.js"

scenarios:
  - name: websocket-operadores
    engine: socketio-v3
    flow:
      - function: "buildHandshake"
      - connect:
          namespace: "/"
          query:
            tipo: "OPERADOR"
            idDepartamento: "{{ idDepartamento }}"
          auth:
            token: "{{ token }}"
      - think: 2
      - think: 2